#pragma once
#include <memory>

class CameraBase;	/// カメラの基底クラス

/// @brief カメラマネージャークラス
class CameraManager
{
public:

	CameraManager() = default;
	~CameraManager();

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief カメラの更新関数
	void Update();

	//===========================================================================
	// 内部関数
	//===========================================================================

	/// @brief カメラ設定を適応する関数
	void SetUpCamera() const;

	/// @brief カメラの切り替え関数
	void ChangeCamera(std::unique_ptr<CameraBase> newCamera);

	//===========================================================================
	// ゲッター
	//===========================================================================

	/// @brief 現在のカメラの取得関数
	///
	/// @return 現在のカメラのスマートポインタへの参照
	const std::unique_ptr<CameraBase>& GetCurrentCamera() const { return m_currentCamera; }

private:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// 現在のカメラ
	std::unique_ptr<CameraBase> m_currentCamera;

};

