#pragma once
#include "CameraData.h"

/// @brief カメラの基底クラス
class CameraBase
{
public:

	CameraBase() = default;
	virtual ~CameraBase() = default;

	//==========================================================================
	// 基本関数
	//==========================================================================

	/// @brief 更新処理
	virtual void Update() = 0;

	/// @brief カメラ設定を適用する
	virtual void SetUpCamera() const = 0;

	//==========================================================================
	// ゲッター
	//==========================================================================

	const CameraData& GetCameraData() const { return m_cameraData; }

protected:

	//==========================================================================
	// メンバ変数
	//==========================================================================

	CameraData m_cameraData;	/// カメラデータ

	float m_clipNear = 2.0f;	/// カメラの近クリップ距離
	float m_clipFar = 10000.0f;	/// カメラの遠クリップ距離

};

