#pragma once
#include "DxLib.h"
#include "CameraData.h"

/// @brief カメラの基底クラス
class CameraBase
{
public:

	CameraBase() = default;
	virtual ~CameraBase() = default;

	//==========================================================================
	// 基本関数
	//==========================================================================

	/// @brief 更新処理
	virtual void Update() = 0;

	//=========================================================================
	// 内部関数
	//==========================================================================

	/// @brief カメラ設定を適用する
	virtual void SetUpCamera() const = 0;

	/// @brief カメラの水平前方向を取得する関数
	///
	/// @return カメラの水平前方向ベクトル（y成分を0にしたベクトル）
	Vec3::Vector3 GetHorizontalForward() const;

	/// @brief カメラの水平右方向を取得する関数
	///
	/// @return カメラの水平右方向ベクトル（y成分を0にしたベクトル）
	Vec3::Vector3 GetHorizontalRight() const;

	//==========================================================================
	// ゲッター
	//==========================================================================

	const CameraData& GetCameraData() const { return m_cameraData; }

protected:

	//==========================================================================
	// メンバ変数
	//==========================================================================

	/// カメラデータ
	CameraData m_cameraData;	

	/// カメラの近クリップ距離
	float m_clipNear = 2.0f;	

	/// カメラの遠クリップ距離
	float m_clipFar = 10000.0f;	

};

