#pragma once

/// @brief カメラ入力クラス
class CameraInput
{
public:

	CameraInput() = default;
	virtual ~CameraInput() = default;

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 更新関数
	void Update();

	//===========================================================================
	// ゲッター
	//===========================================================================

	/// @brief カメラの横回転を取得する関数
	///
	/// @return カメラの横回転
	float GetRotateX() const { return m_rotateX; }

	/// @brief カメラの縦回転を取得する関数
	///
	/// @return カメラの縦回転
	float GetRotateY() const { return m_rotateY; }

private:

	//=======================================================================
	// メンバ変数
	//=======================================================================

	/// カメラの横回転
	float m_rotateX = 0.0f;

	/// カメラの縦回転
	float m_rotateY = 0.0f;

};

