#pragma once
#include "DxLib.h"

/// @brief カメラ振動クラス
class CameraShake
{
public:

	CameraShake() = default;
	virtual ~CameraShake() = default;

	//========================================================================
	// 基本関数
	//========================================================================

	/// @brief 更新関数
	void Update();

	//========================================================================
	// 内部関数
	//========================================================================

	/// @brief カメラ振動を実行する関数
	///
	/// @param duration 振動の継続時間
	/// @param magnitude 振動の強さ
	void PlayShake(float duration, float magnitude);

	/// @brief カメラ振動が再生中かどうかを判定する関数
	///
	/// @return 再生中の場合はtrue、そうでない場合はfalse
	bool IsShaking() const { return m_duration > 0.0f; }

	//========================================================================
	// ゲッター
	//========================================================================

	/// @brief 振動のオフセットを取得する関数
	///
	/// @return 振動のオフセット
	VECTOR GetShakeOffset() const { return m_shakeOffset; }

protected:

	//========================================================================
	// 内部関数
	//========================================================================

	

	//========================================================================
	// メンバ変数
	//========================================================================

	/// 振動のタイマー
	float m_shakeTimer		= 0.0f;

	/// 振動の継続時間
	float m_duration		= 0.0f;

	/// 振動の強さ
	float m_magnitude		= 0.0f;

	/// 振動のオフセット
	VECTOR m_shakeOffset	= { 0.0f, 0.0f, 0.0f };

};

