#pragma once
#include <memory>
#include "ObjectLogic.h"
#include "ICharacterAction.h"

/// @brief キャラクタークラス
class Character : public ObjectLogic
{
public:

	Character();
	virtual ~Character();

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 初期化関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	virtual bool Initialize() override;

	/// @brief 終了関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	virtual bool Terminate() override;

	/// @brief 更新関数
	virtual void Update() override;

	//===========================================================================
	// 内部関数
	//===========================================================================

	/// @brief アクションの設定関数
	///
	/// @param newAction 新しいアクション
	void SetAction(std::unique_ptr<ICharacterAction> newAction);

	//===========================================================================
	// ゲッター
	//===========================================================================



	//===========================================================================
	// セッター
	//===========================================================================



protected:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// 現在実行しているアクション
	std::unique_ptr<ICharacterAction> m_currentAction;

};

