#pragma once

/// @brief FPSのデバッグ表示クラス
class DebugFps
{
public:

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 更新関数
	void Process();

	/// @brief 描画関数
	void Render();

private:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	int m_frameCount = 0;	/// フレームカウント
	int m_startTime = 0;	/// 計測開始時間
	float m_fps = 0.0f;		/// FPS値
		
};

