#pragma once

class CameraManager;	/// カメラマネージャークラス

/// @brief ゲームのコンテキストを管理するクラス
class GameContext
{
public:

	//===========================================================================
	// ゲッター
	//===========================================================================

	/// @brief カメラマネージャークラスの参照を取得する関数
	///
	/// @return カメラマネージャークラスの参照
	CameraManager& GetCameraManager() const;

	//===========================================================================
	// セッター
	//===========================================================================

	/// @brief カメラマネージャークラスの参照用ポインタを設定する関数
	///
	/// @param cameraManager 設定するカメラマネージャークラスの参照用ポインタ
	void SetCameraManager(CameraManager* cameraManager) { m_cameraManager = cameraManager; }

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// カメラマネージャークラスの参照用ポインタ
	CameraManager* m_cameraManager = nullptr;

};

