#pragma once

/// @brief キャラクターのコンポーネントを管理するクラス
///
/// @tparam TOwner コンポーネントを所有するクラスの型
template<typename TOwner>
class IComponent
{
public:

	virtual ~IComponent() = default;

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 初期化関数
	/// 
	/// @param owner 初期化処理を行うキャラクター
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	virtual bool Initialize(TOwner& owner) { return true; }

	/// @brief 更新関数
	///
	/// @param owner 更新処理を行うキャラクター
	virtual void Update(TOwner& owner) {};

	//===========================================================================
	// 内部関数
	//===========================================================================

	/// @brief コンポーネントの所有者を設定する関数
	///
	/// @param owner コンポーネントを所有するキャラクター
	/// 
	/// @return コンポーネントを所有しているキャラクターのポインタ
	TOwner* GetOwner() const { return m_owner; }

private:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// コンポーネントを所有するキャラクターのポインタ
	TOwner* m_owner = nullptr;

};

