#pragma once
#include "LightData.h"

/// @brief ライトクラス
class Light
{
public:

	Light();
	virtual ~Light();

	//=======================================================================
	// 基本関数
	//=======================================================================

	/// @brief 初期化関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Initialize();	

	/// @brief 終了関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Terminate();

	/// @brief 更新関数
	void Process();

	//=======================================================================
	// ゲッター
	//=======================================================================

	/// @brief ライトデータ取得
	///
	/// @return ライトデータ
	const LightData& GetLightData() const { return m_lightData; }

protected:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// ライトデータ
	LightData m_lightData;

};

