#pragma once
#include "appframe.h"

/// @brief マップデータ構造体
struct MapData
{
	VECTOR pos;		///< マップの位置
	int mapHandle;	///< マップのグラフィックハンドル
	int skyHandle;	///< スカイのグラフィックハンドル

	MapData()
	{
		pos = { 0.0f, 0.0f, 0.0f };
		mapHandle = -1;
		skyHandle = -1;
	}
};

/// @brief マップクラス
class Map
{
public:

	Map();
	virtual ~Map();


	//=======================================================================
	// 基本関数
	//=======================================================================


	/// @brief 初期化関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Initialize();	

	/// @brief 終了関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Terminate();	


	//=======================================================================
	// 内部関数
	//=======================================================================





	//=======================================================================
	// ゲッター
	//=======================================================================


	/// @brief マップデータ取得
	/// 
	/// @return マップデータ
	const MapData& GetMapData() const { return m_mapData; }


	//=======================================================================
	// セッター
	//=======================================================================




protected:


	//=======================================================================
	// メンバ変数
	//=======================================================================


	MapData m_mapData;	/// @brief マップデータ

};

