#pragma once
#include "MapData.h""

/// @brief マップクラス
class Map
{
public:

	Map() = default;
	virtual ~Map() = default;

	//=======================================================================
	// 基本関数
	//=======================================================================

	/// @brief 初期化関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Initialize();	

	/// @brief 終了関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	bool Terminate();

	//=======================================================================
	// ゲッター
	//=======================================================================

	/// @brief マップデータ取得
	/// 
	/// @return マップデータ
	const MapData& GetMapData() const { return m_mapData; }

protected:

	//=======================================================================
	// メンバ変数
	//=======================================================================

	/// マップデータ
	MapData m_mapData;




	/// ステージBGM
	int m_stageBgm;

};

