#pragma once
#include "ObjectData.h"

class GameContext;	/// ゲームのコンテキストクラス

/// @brief ゲーム内のオブジェクトのロジックを管理するクラス
class ObjectLogic
{
public:

	ObjectLogic() = default;
	virtual ~ObjectLogic() = default;

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 初期化関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	/// 
	/// @note この純粋仮想関数は、派生クラスでオーバーライドされる必要があります。
	virtual bool Initialize() = 0;

	/// @brief 終了関数
	///
	/// @return 成功しているならtrue、失敗しているならfalse
	/// 
	/// @note この純粋仮想関数は、派生クラスでオーバーライドされる必要があります。
	virtual bool Terminate() = 0;

	/// @brief 更新関数
	///
	/// @param gameContext 更新処理に必要なゲームコンテキスト
	/// 
	/// @note この純粋仮想関数は、派生クラスでオーバーライドされる必要があります。
	virtual void Update(const GameContext& gameContext) = 0;

	//===========================================================================
	// ゲッター
	//===========================================================================

	/// @brief オブジェクトデータ取得
	/// 
	/// @return オブジェクトデータ
	const ObjectData& GetObjectData() const { return m_data; }

	//===========================================================================
	// セッター
	//===========================================================================

	/// @brief オブジェクトデータ設定
	///
	/// @param data 設定するオブジェクトデータ
	void SetObjectData(const ObjectData& data) { m_data = data; }

protected:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// オブジェクトのデータ
	ObjectData m_data;

};

