#pragma once
#include "DxLib.h"
#include <vector>

/// @brief プリミティブクラス
class PrimitiveShapeBase
{
public:
		
	PrimitiveShapeBase() = default;
	virtual ~PrimitiveShapeBase() = default;

	//===========================================================================
	// 基本関数
	//===========================================================================

	/// @brief 描画関数
	virtual void Render();

	//===========================================================================
	// 内部関数
	//===========================================================================

	/// @brief プリミティブデータをクリアする関数
	void ClearPrimitiveData();

	//===========================================================================
	// セッター
	//===========================================================================

	/// @brief テクスチャハンドルを設定する関数
	///
	/// @param textureHandle 設定するテクスチャハンドル
	void  SetTextureHandle(int textureHandle) { m_textureHandle = textureHandle; }

protected:

	//===========================================================================
	// メンバ変数
	//===========================================================================

	/// 頂点データ
	std::vector<VERTEX3D> m_vertices;

	/// インデックスデータ
	std::vector<unsigned short> m_indices;

	/// テクスチャハンドル
	int m_textureHandle = -1;
};